clc;
% методика синтеза линейно-квадратичного регулятора для непрерывной системы в пакете MATLAB с помощью процедуры-функции lqr или lqry .
clear all;

%исходные данные
k=70;
psi=0.15;
T=0.3;

%задаем передаточную функцию
s    = tf('s');
W    = k/(T^2 * s^2 + 2*psi*T*s + 1);
print(W);
%преобразуем в пространство состояний и получаем матарицы пространства состояний 
Pss = ss(W);
[A, B, C, D] = ssdata(Pss);


%строим переходную характеристику исходной системы
figure(1);
step(W);grid on; hold on;

tp   = 7.7559;  %время переходного процесса
t1   = 0.921; %время достижения пикового значения
x1   = 113.2077;  %пиковое значение переходной характеристики
x2   = x1/t1;
s    = stepinfo(W);
 



%методика Брайсона
q11 = 1/(tp*x1^2);
q22 = 1/(tp*x2^2);
Q1 = [q11 0; 0 q22];
R = 1;%так как входное воздействие-ступенька
N = 0;
[K,S,E] = lqr(A,B,Q1,R,N);
Wbr     = reg(Pss,K,[0;1]);
print(Wbr);
figure(2);
step(Wbr);grid on; hold on;


%%методика Эллерта
qp1=1/A(1,2)^2*B(1)^2;
qp2=1/T^4+6*A(1,1)*psi/T^3+A(1,1)^2*(12*psi+2)/T^2+8*A(1,1)^3*psi/T;
qp3=2*A(1,1)*A(1,2)*A(2,1)*A(2,2)+2*A(1,1)^2*A(1,2)*A(2,1)+A(1,2)^2*A(2,1)^2+A(1,1)^4;
q11=qp1*(qp2+qp3);
q22=(1/(B(1))^2)*((4*psi^2-2)/T^2-(A(1,1))^2-(A(2,2))^2-2*A(1,2)*A(2,1));
Q=[q11 0;0 q22];
R=1;
N=0;  
[K,S,E]=lqr(A,B,Q,R,N);
Wel=reg(Pss,K,[0;1]);
print(Wel);
figure(3);
step(Wel);grid on; hold on; 






